# التكليف 10
#  قم بعمل قائمة فيها لغات البرمجة المشهورة وداخلها قائمة فرعية فيها أسماء أطر عمل مشهورة ثم في السطر الأول قم بطباعة إسم اول اطار عمل في القائمة الفرعية وفي السطر الثاني إسم آخر إطار عمل في القائمة الفرعية مع مراعاة أن القائمة الفرعية يمكن أن تزيد ولكنها دائما آخر عنصر في القائمة الرئيسية

# technologies = ["Html", "CSS", "JS", "Python", ["Django", "Flask", "Web"]]

# # Needed Output
# # Django
# # Web

# ==================================

technologies = ["Html", "CSS", "JS", "Python", ["Django", "Flask", "Web"]]
print(technologies[-1][0])
print(technologies[-1][-1])