# التكليف 02

    # قم بإنشاء Directory بإسم Python على ال Desktop
    # قم بإنشاء ملف بإسم index.py داخل ال Directory
    # قم بإنشاء قاعدة بيانات في نفس ال Directory بإسم elzero.db
    # قم بإنشاء جدول المستخدمين يحتوي على ال id والإسم وتاريخ الميلاد والإيميل
    # إختر نوع البيانات المناسب لكل حقل
    # يجب التأكد أن الجدول غير موجود قبل إنشائه
    # جميع الحقول Unique ولا يمكن إضافة نفس البيانات مرة أخرى

# ########################################
#  in python folder    assignment [ 02 , 03 , 04 , 05 ] 
