# التكليف 06
# قم بعمل متغير فيه أي رقم تريده ونوعه String ثم قم بوضع أصفار قبل أي رقم يتم وضعه كقيمة للمتغير على أن لا يزيد عرض الأعداد عن 4 أعداد فمثلا ال 20 تكون 0020 وال 199 تكون 0199 وال 1200 تكون كما هي 1200, شاهد المطلوب في المثال التالي

# num = "9"
# num = "15"
# num = "130"
# num = "950"
# num = "1500"

# # Needed Output
# # 0009
# # 0015
# # 0130
# # 0950
# # 1500
#  =====================
num = "9"
print(num.zfill(4))
num = "15"
print(num.zfill(4))

num = "130"
print(num.zfill(4))
num = "950"
print(num.zfill(4))

num = "1500"
print(num.zfill(4))
