''' 
ماذا تحتاج للتحميل لبدأ التعلم
– يجب عليك تحميل محرر الأكواد لبدأ العمل على اللغة وقمنا في الدورة بإستعمال برنامج Visual Studio Code ويمكنك أيضا إستعمال برنامج رائع مثل PyCharm ولك الخيار كلهم يقوموا بنفس الفكرة وبعد الإحتراف سوف تستطيع إختيار ما هو مناسب لك بإذن الله.
– تحتاج لتحميل لغة Python وهنا الإصدار الموجود في الدورة يمكنك تحميله من هنا
– باقي المعلومات جميعا موجودة داخل الدرس ويمكنك تحميلها من داخل البرنامج وبعضها معلومات مهمة لتبدأ بها.
# =============================================================
ملاحظات الدرس
يجب عليك معرفة أنه عند إختيار مسار معين للخوض فيه مثل مسار ال Web مثلا فيجب عليك إتقان اللغات الموجودة في هذا المسار حيث أن معرفتك بلغة Python وحدها لا تكفي فإنه عند إستخدام اطار عمل مثل Flask أو Django مثلا يجب عليك معرفة اللغات الخاصة بتصميم ال Web مثل Html, Css, Javascript وباقي اللغات والأدوات وهكذا.
# =======================================

link : https://www.youtube.com/watch?v=02a5T6ktx8M&list=PLDoPjvoNmBAyE_gei5d18qkfIe-Z8mocs
'''
