# التكليف 03

#     قم بإنشاء Set تحتوي على العناصر 1, 2, 3
#     في السطر الأول قم بطباعة محتوى ال Set
#     قم بإفراغ محتوى ال Set كاملا بسطر واحد فقط ثم قم بطباعة المحتوى في السطر الثاني لتتأكد من أنها فارغة تماما
#     قم بإضافة عنصرين “A”, “B” لهذه ال Set ثم إطبع محتواها في السطر الثالث
#     قم بمحاولة إزالة العنصر “C” طبعا العنصر غير موجود تأكد أنه لن يخرج لك خطأ عندما تحاول إزالة العنصر الغير موجود

# my_set = {1, 2, 3}
# letters = {"A", "B", "C"}

# # Needed Output

# # {1, 2, 3}
# # set()
# # {"A", "B"}
# ==========================================


my_set = {1, 2, 3}
letters = {"A", "B", "C"}

print(my_set)
my_set.clear()
print(my_set)
my_set = letters.copy()
my_set.remove("C")
print(my_set)
my_set.discard("C")

